org/about.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-11-17 Чт. 01:19 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
<meta name="author" content="rigidus" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga8bc790">1. О сайте</a>
<ul>
<li><a href="#orgb0a9426">1.1. Цель создания</a></li>
<li><a href="#orgc4c1638">1.2. Исходный код</a></li>
<li><a href="#org9f0043d">1.3. Текущий статус</a></li>
</ul>
</li>
<li><a href="#org4e6893c">2. Обо мне</a>
<ul>
<li><a href="#org33da24b">2.1. Личная информация</a></li>
<li><a href="#org87f4722">2.2. Исследовательский опыт</a></li>
<li><a href="#org2016b5b">2.3. Опыт работы</a></li>
<li><a href="#org2f4587d">2.4. Членства в ассоциациях/организациях</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orga8bc790" class="outline-2">
<h2 id="orga8bc790"><span class="section-number-2">1</span> О сайте</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-orgb0a9426" class="outline-3">
<h3 id="orgb0a9426"><span class="section-number-3">1.1</span> Цель создания</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Этот сайт был изначально создан для сбора редких и интересных
материалов о вычислительных моделях и языках
программирования. Позже он также превратился в занимательное
упражнение в реализации разнообразных программистких концепций.
</p>
</div>
</div>

<div id="outline-container-orgc4c1638" class="outline-3">
<h3 id="orgc4c1638"><span class="section-number-3">1.2</span> Исходный код</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Исходный код открыт по лицензии GNU v.3. Данные, в том числе
руководства и книги, могут иметь свои лицензии.
</p>

<p>
Репозиторий с исходным кодом и историей коммитов доступен на
<a href="https://github.com/rigidus/rigidus.ru">https://github.com/rigidus/rigidus.ru</a>
</p>

<p>
Вы можете делать любые дополнения и предложения в форме
<code>pull-requests</code> и <code>issue</code>.
</p>
</div>
</div>

<div id="outline-container-org9f0043d" class="outline-3">
<h3 id="org9f0043d"><span class="section-number-3">1.3</span> Текущий статус</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Отдельные вещи здесь переделываются прямо на ходу и кое-что может не работать по двум
причинам:
</p>
<ul class="org-ul">
<li>Во-первых, я изменяю их, чтобы привести в соответствие с
некоторым, постоянно изменяющимся ощущением "правильности".</li>
<li>Во-вторых, отдельный части изменяются независимо от моей воли по
сложным, часто недостаточно оттестированным экспериментальным
алгоритмам, которые было бы безответственно запускать где-то еще.</li>
</ul>

<p>
Если вы заметили ошибку или неточность - пожалуйста, сообщите мне
об этом. Вы можете воспользоваться для этого способами, изложенными
выше.
</p>
</div>
</div>
</div>

<div id="outline-container-org4e6893c" class="outline-2">
<h2 id="org4e6893c"><span class="section-number-2">2</span> Обо мне</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-org33da24b" class="outline-3">
<h3 id="org33da24b"><span class="section-number-3">2.1</span> Личная информация</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Меня зовут Глухов Михаил, я также известен как <code>rigidus</code>. Этот ник
был выбран с целью упростить поиск в поисковых системах.
</p>

<p>
Я родился в 1982 году в г. Ленинград, теперь - Санкт-Петербург.
</p>

<p>
Мне можно в любой момент позвонить по телефону <code>8(911)286-92-90</code>
или написать на <code>i.am.rigidus at gmail dot com</code>
</p>

<p>
Я занимаюсь программированием и исследованиями в связанных
областях. Моя работа тоже имеет к этому самое прямое отношение.
</p>

<p>
Я накопил значитетельный опыт за это время и готов делиться
экспертизой.
</p>
</div>
</div>

<div id="outline-container-org87f4722" class="outline-3">
<h3 id="org87f4722"><span class="section-number-3">2.2</span> Исследовательский опыт</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Я сделал несколько исследовательских работ (часть из которых еще не
завершена):
</p>
<ul class="org-ul">
<li>Проверка корректности автоматных парсеров контекстно-свободных
языков</li>
<li>Верификация протоколов обмена сообщениями в распределенных сетях</li>
<li>Создание языков предметной области систем автоматизированного
принятия решений</li>
<li>Автоматизация написания декомпиляторов для регисто-стековых
виртуальных машин</li>
<li>Построение и анализ средств визуального программирования для
языков предметной области для систем реактивного управления</li>
<li>Распределенные виртуальные машины с разделяемым состоянием</li>
</ul>
</div>
</div>

<div id="outline-container-org2016b5b" class="outline-3">
<h3 id="org2016b5b"><span class="section-number-3">2.3</span> Опыт работы</h3>
<div class="outline-text-3" id="text-2-3">
</div>
</div>

<div id="outline-container-org2f4587d" class="outline-3">
<h3 id="org2f4587d"><span class="section-number-3">2.4</span> Членства в ассоциациях/организациях</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Постоянный участник и докладчик семинаров по функциональному
программированию в Санкт-Петербурге <a href="https://plus.google.com/communities/106931692847918217517">fprog-community</a> и
<a href="http://piter-united.ru/">IT-Global-Meetup</a>
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: rigidus</p>
<p class="date">Created: 2016-11-17 Чт. 01:19</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
